app/views/favorites/_like_button.html.erb

  <% if current_user.liking?(micropost) %>
    <%= form_for(current_user.favorites.find_by(micropost_id: micropost.id), html: { method: :delete }) do |f| %>
---
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 1 AND `favorites`.`micropost_id` = 11 LIMIT 1