app/controllers/favorites_controller.rb

  def create
    micropost = Micropost.find(params[:micropost_id])
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 11 LIMIT 1

  def destroy
    micropost = Micropost.find(params[:micropost_id])
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 11 LIMIT 1