app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
      flash[:success] = 'メッセージを投稿しました。'
      redirect_to root_url
    else
      @microposts = current_user.feed_microposts.order('created_at DESC').page(params[:page])
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('hello', 3, '2017-11-11 10:13:48', '2017-11-11 10:13:48')
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 3 ORDER BY created_at DESC LIMIT 25 OFFSET 0

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 6