app/controllers/users_controller.rb

  def index
    @users=User.all.page(params[:page])
---
SELECT  `users`.* FROM `users` LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM `users` LIMIT 25 OFFSET 0) subquery_for_count

  def show
    @user=User.find(params[:id])
    @microposts = @user.microposts.order('created_at DESC').page(params[:page])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 3 ORDER BY created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `microposts` INNER JOIN `favorites` ON `microposts`.`id` = `favorites`.`micropost_id` WHERE `favorites`.`user_id` = 1

  def followings
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def followers
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def likes
    @user=User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1